sdaiValidateUniqueness(Sdai_instS*,Sdai_instS*,Sdai_Id_aggr*)
\details
Checks the constraint (Uniqueness-Rule) for the schema instance.
\param schemaInstance [in] A schema instance.
\param uniRule        [in] A uniqueness rule to be validated.
\param list           [out] An identifier of a pre-existing NPL that stores the list of entity instances that contains the instances with false validation result.
\returns sdaiTRUE if the uniqueness rule is satisfied; sdaiFALSE if the uniqueness rule is violated or sdaiUNKNOWN if an error has happened.